{
  "payloads": [
    {
      "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
      "maximumAccessLevelRequired": 1,
      "state": 3,
      "createdAt": 1714111595,
      "queuedAt": 1714459619,
      "executedAt": 1714546043,
      "cancelledAt": 0,
      "expirationTime": 1717135595,
      "delay": 86400,
      "gracePeriod": 604800,
      "actions": [
        {
          "target": "0x2C3f5D3EB59074631DC33763D903afD8426868C2",
          "withDelegateCall": true,
          "accessLevel": 1,
          "value": "0",
          "signature": "execute()",
          "callData": "0x"
        }
      ],
      "id": 114,
      "chainId": 1,
      "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
    }
  ],
  "ipfs": {
    "ipfsHash": "QmdvZwBajukf3eaGok4dFBcnSDyWVyFNzfN5okBfaHn31P",
    "description": "\n## Simple Summary\n\nThis AIP will onboard the LlamaRisk team as Aave's second Risk Service Provider and set up the payment stream.\n\n## Motivation\n\nThe Aave DAO is using a dual risk provider models, since a spot is vacant and a [snapshot vote](https://snapshot.org/#/aave.eth/proposal/0x2b7433455b16d50b9b6afdf2e60bfd6e733896224688c9891c371aa2597853a2) to choose a new one among three candidates ended with the community voicing their support for the LlamaRisk Team, this AIP is here to make it official and set the payment stream to compensate them with 250,000 GHO over the next 6 months of their engagement.\n\n## Specification\n\nRecognizing the significance of a dual risk provider model, LlamaRisk’s proposal is designed to complement Chaos Labs’ risk services, with whom we plan to collaborate extensively.\n\nThe initial 6-month engagement, which may be extended pending DAO approval, involves the following scope:\n\n- **On-demand Risk Assessments:** LlamaRisk will deliver prompt and in-depth risk assessments for assets listed or considered to be listed on Aave with particular emphasis on the collateral types comprising the GHO stablecoin. This will involve developing a custom framework tailored specifically to the categories of relevant assets and Aave’s needs, which will standardize the assessment process.\n- **Collaborative Engagement with Chaos Labs:** We plan to collaborate extensively with Chaos Labs, combining our expertise to provide Aave with comprehensive and nuanced risk analysis, enhancing the protocol’s risk management capacity.\n- **Active Involvement in DAO Governance:** LlamaRisk will actively participate in Aave’s DAO governance, offering informed insights and strategic recommendations on risk management practices for principal stakeholders and the community.\n- **Legal Regulatory Advisory and Policy Work:** We will offer specialized legal research and regulatory guidance, including a thorough analysis of evolving legal frameworks and regulatory policies, and equip Aave with the necessary foresight to navigate the regulatory landscape of the DeFi sector effectively.\n\nRisk vectors are diverse and cannot be fully managed by qualitative risk tools. That is why we specialize in comprehensive risk assessment of tokenized assets and DeFi protocols. Our work supports our partners in making informed decisions that mitigate potential threats and promote a culture of transparency and sustainability. Our team of experts meticulously evaluate various risk factors, including but not limited to:\n\n- Protocol design and architecture\n- Tokenomics and economic incentives\n- Smart contract security\n- Governance mechanisms\n- Regulatory compliance\n\nLlamaRisk leverages advanced simulation techniques, including statistical and agent-based modeling, to test and validate DeFi protocols and their collateral assets under various stress scenarios. Our simulations provide valuable insights into potential risks, allowing our partner protocols to set competitive parameters resilient to adverse market conditions.\n\nOur DeFi strategy managers employ data analytics and risk monitoring tools that allow us to maintain high efficiency and safety standards. We support our partners with publications and dashboards that give users the information they need to interact with the protocol responsibly.\n\nOur advisory services cater to the unique needs of DeFi projects, providing strategic guidance and support throughout their lifecycle. From ideation to implementation, our experienced advisors offer expert advice on protocol design, tokenomics, governance, and risk management strategies, ensuring optimal outcomes for our partners.\nComment\n\nTraversing the complex regulatory landscape is crucial for DeFi protocols and projects. Our team of legal experts provides in-depth analysis and guidance to ensure compliance with applicable laws and regulations. We evaluate legal risks, assist with regulatory filings, and help clients develop robust strategies for operating within the evolving regulatory framework.\n\nWe actively engage in policy development and legislative processes related to crypto and blockchain at national, supranational, and international levels. This includes participating in specialized working groups, contributing opinions to public discussions on regulatory developments, and involvement in policymaking dialogues. We aim to ensure that DeFi stakeholders are represented and protected in the evolving regulatory landscape, facilitating informed and proactive responses to legislative changes.\n\n## Technical specification\n\nThis AIP will have the collector setup a 250 000 GHO stream for 6 months toward the LlamaRisk treasury address.\n\n## References\n\n- Implementation: [AaveV3Ethereum](https://github.com/bgd-labs/aave-proposals-v3/blob/b2a5bfef825f4341b8f24f95dcbc1ec894a02d07/src/20240421_AaveV3Ethereum_LlamariskRiskProvider/AaveV3Ethereum_LlamariskRiskProvider_20240421.sol)\n- Tests: [AaveV3Ethereum](https://github.com/bgd-labs/aave-proposals-v3/blob/b2a5bfef825f4341b8f24f95dcbc1ec894a02d07/src/20240421_AaveV3Ethereum_LlamariskRiskProvider/AaveV3Ethereum_LlamariskRiskProvider_20240421.t.sol)\n- [Snapshot](https://snapshot.org/#/aave.eth/proposal/0x2b7433455b16d50b9b6afdf2e60bfd6e733896224688c9891c371aa2597853a2)\n- [Discussion](https://governance.aave.com/t/arfc-onboard-new-risk-service-provider/17348)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "title": "Onboard Llamarisk as a Risk Provider",
    "author": "Aave Chan Initiative",
    "discussions": "https://governance.aave.com/t/arfc-onboard-new-risk-service-provider/17348",
    "snapshot": "https://snapshot.org/#/aave.eth/proposal/0x2b7433455b16d50b9b6afdf2e60bfd6e733896224688c9891c371aa2597853a2",
    "originalIpfsHash": "0xe78fa71ec1e15432e74698a4e94c0120bef1b2817343e6d55296b3f53ef63386"
  },
  "proposal": {
    "id": 90,
    "votingDuration": 259200,
    "creationTime": 1714111643,
    "accessLevel": 1,
    "state": 4,
    "queuingTime": 1714459607,
    "ipfsHash": "0xe78fa71ec1e15432e74698a4e94c0120bef1b2817343e6d55296b3f53ef63386",
    "initialPayloads": [
      {
        "id": 114,
        "chainId": 1,
        "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
      }
    ],
    "snapshotBlockHash": "0xa96cbcc69f9c969fbe4818466faaa9c847db9abf80dee8eb5c808957c7968b26",
    "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
    "canceledAt": 0,
    "votingActivationTime": 1714198067,
    "votingChainId": 137,
    "votingMachineData": {
      "id": 90,
      "forVotes": "541848439283109255423719",
      "againstVotes": "0",
      "startTime": 1714199049,
      "endTime": 1714458249,
      "votingClosedAndSentBlockNumber": 56411792,
      "votingClosedAndSentTimestamp": 1714458284,
      "l1BlockHash": "0xa96cbcc69f9c969fbe4818466faaa9c847db9abf80dee8eb5c808957c7968b26",
      "strategy": "0x59e6CAD5d7E7b9A26a45a1d1E74C7aF008170042",
      "sentToGovernance": true,
      "createdBlock": 56302655,
      "votedInfo": {
        "support": false,
        "votingPower": "0"
      },
      "votingAssets": [
        "0x7Fc66500c84A76Ad7e9c93437bFc5Ac33E2DDaE9",
        "0x4da27a545c0c5B758a6BA100e3a049001de870f5",
        "0xA700b4eB416Be35b2911fd5Dee80678ff64fF6C9"
      ],
      "hasRequiredRoots": true
    },
    "isFinished": true,
    "lastUpdatedTimestamp": 1714575968,
    "cancellationFee": 50000000000000000
  }
}