{
  "payloads": [
    {
      "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
      "maximumAccessLevelRequired": 1,
      "state": 3,
      "createdAt": 1729258775,
      "queuedAt": 1729606835,
      "executedAt": 1729693295,
      "cancelledAt": 0,
      "expirationTime": 1732282775,
      "delay": 86400,
      "gracePeriod": 604800,
      "actions": [
        {
          "target": "0x9ECAE4b686BF3D6Ce72015D4C29B2B86Cc34f0eD",
          "withDelegateCall": true,
          "accessLevel": 1,
          "value": "0",
          "signature": "execute()",
          "callData": "0x"
        }
      ],
      "id": 193,
      "chainId": 1,
      "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
    }
  ],
  "ipfs": {
    "ipfsHash": "QmeXUovu3JkKw5gEYXAH4HfizBfsn17gPuxfB8eHkriXu6",
    "description": "\n## Simple Summary\n\nThis AIP propose to renew Llama risk engagement for the next 6 months and will create a payment stream for 400,000 GHO for the same amount of time.\n\n## Motivation\n\nWe’ll keep this short. When we [initially applied](https://governance.aave.com/t/temp-check-onboard-llamarisk-as-aave-risk-service-provider) to serve Aave as a risk service provider, our primary goal was to deliver complementary and collaborative work alongside @ChaosLabs, focusing on qualitative analysis, ad hoc research, and legal/regulatory advisory.\n\nFive months later, we are confident that we have fulfilled this commitment, a sentiment that numerous delegates and service providers have echoed. Our work has made a significant impact on safely integrating newly onboarded assets, and we have fostered a great relationship with @ChaosLabs, holding regular meetings, aligning internally, and driving informed decisions. We place high importance on furthering the common mission of all Aave service providers to promote sustainable growth of the protocol, and to that end we have engaged in collaborations and taken steps to join task forces with numerous ecosystem teams.\n\nAlthough most of our work is publicly available through [monthly community updates](https://governance.aave.com/t/llamarisk-monthly-community-update/), we have made several positive contributions behind the scenes. These include advocating for bug bounty programs, improved access controls, and increased transparency for end users. A good example of such activity is our work behind the scenes on WBTC to ensure sensible and compliant steps in its custody restructuring partnership with BiT Global. This presented LlamaRisk an opportunity to showcase its expertise in evaluating regulatory risk and to diplomatically navigate a sensitive situation to protect the interests of Aave and its users.\n\nOur staged onboarding plan has allowed us to manage the allocated budget prudently, with a steady increase in workforce and dedicated resources to Aave. As a reminder, LlamaRisk is a community-led, non-profit organization that aligns with Aave in making the protocol as secure and resilient as possible to bolster its capacity for sustainable growth. All funds are directed towards contributor compensation and infra expenses related to Aave.\n\n## Scope\n\nAs we enter the next engagement phase, we request a six month engagement for a total of $400,000, to be paid either in GHO or aToken stables, at the DAO’s discretion. While this represents a 60% increase over our initial budget, it amounts to a marginal increase from our current burn rate, which we have prudently managed as we’ve expanded our team and substantially increased our contributions to AAVE DAO. The total amount requested for the engagement is in addition to continuing our current scope, we plan to extend the following services to the Aave DAO:\n\n- **Risk Monitoring**: Liquidity depth monitoring and markets exposure analysis for Aave markets will aid our ad hoc research efforts and inform our team about concerning liquidity trends and inconsistencies in Aave’s exposure between individual assets and asset categories. As with all our research and analysis, we will make Aave markets liquidity data and analysis public through an Aave risk portal dashboard for the benefit of DAO contributors and Aave users. This will also allow us to better collaborate with Chaos Labs to identify and proactively respond to evolving market conditions.\n- **Probationary Onboarding Framework**: Typically an asset risk review is conducted prior to onboarding, but especially since Aave may seek to onboard assets with a short history for strategic reasons, an extended 2-month probation period is prudent. LlamaRisk will define and implement a framework for probationary asset offboarding for cases where assets are not satisfying market health and growth expectations. Establishing clear guidelines will also serve protocol teams in setting targets and aligning expectations.\n- **Chain Ecosystem Framework**: While BGD Labs can devote resources toward evaluating chain deployments from a security and technical perspective, LlamaRisk can supplement evaluations from an economic perspective. Our Chain Evaluation Framework will detail available DeFi applications, user behaviors, and ecosystem-wide assets review to identify the market risk associated with the proposed chain deployment. The framework guidelines will benefit chain candidates through the establishment of clear expectations around building liquidity and an ecosystem that is minimally eligible for Aave.\n- **RWA Integrations**: RWAs present an integration challenge and an opportunity to cross the divide between DeFi and TradFi. The challenges mainly revolve around regulatory hurdles and specialized design requirements to satisfy those limitations. We are leveraging our regulatory expertise in collaboration with Chainlink to develop standards for RWA integrations that are compliant and scalable to meet the requirements of the numerous RWAs coming to market. This will involve research into legal structures (including BORGs) to facilitate such integrations.\n- **Legal Research**: Focusing on the MiCA treatment of governance tokens, with a specific emphasis on the amended features of AAVE following the AAVEnomics update. We intend to draft a comprehensive report that will delve into the legal implications of these changes. Additionally, we will closely monitor the mandatory ESMA/EBA guidance issued under MiCA and are committed to producing concise briefs that outline their implications for the AAVE token.\n\nAs all indicators suggest that Aave is entering a new growth phase, we wish to continue bringing value as an independent, pragmatic, and stabilizing voice within the DAO. Many of the brightest minds in our industry serve the Aave DAO; we are enthusiastic about being among your ranks and look forward to growth and ongoing collaboration with all of you.\n\n## Specification\n\nCreate a payment stream of 400,000 GHO to the address `0xE8555F05b3f5a1F4566CD7da98c4e5F195258B65`, a LlamaRisk controlled multisig, for 6 months starting from the end of the previous engagement (Oct 28th, 2024 / timestamp 1730098043)\n\n## References\n\n- Implementation: [AaveV3Ethereum](https://github.com/bgd-labs/aave-proposals-v3/blob/91a9c28bd302c0e162a34a1d8968f0d5b09745c7/src/20241013_AaveV3Ethereum_RenewLlamaRiskAsRiskServiceProvider/AaveV3Ethereum_RenewLlamaRiskAsRiskServiceProvider_20241013.sol)\n- Tests: [AaveV3Ethereum](https://github.com/bgd-labs/aave-proposals-v3/blob/91a9c28bd302c0e162a34a1d8968f0d5b09745c7/src/20241013_AaveV3Ethereum_RenewLlamaRiskAsRiskServiceProvider/AaveV3Ethereum_RenewLlamaRiskAsRiskServiceProvider_20241013.t.sol)\n- [Snapshot](https://snapshot.org/#/aave.eth/proposal/0x3c8116f97f990bf61fe63c636c1ae85630ad355e26881285aa4fefaebd8c9c0d)\n- [Discussion](https://governance.aave.com/t/arfc-renew-llamarisk-as-risk-service-provider/19277)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "title": "Renew LlamaRisk as Risk Service Provider",
    "author": "Aave Chan Initiative",
    "discussions": "https://governance.aave.com/t/arfc-renew-llamarisk-as-risk-service-provider/19277",
    "snapshot": "https://snapshot.org/#/aave.eth/proposal/0x3c8116f97f990bf61fe63c636c1ae85630ad355e26881285aa4fefaebd8c9c0d",
    "originalIpfsHash": "0xf0812faba2ea8655fa8db894c5b06515dea31a90b702f7e606169a025648abdd"
  },
  "proposal": {
    "id": 185,
    "votingDuration": 259200,
    "creationTime": 1729258823,
    "accessLevel": 1,
    "state": 4,
    "queuingTime": 1729606823,
    "ipfsHash": "0xf0812faba2ea8655fa8db894c5b06515dea31a90b702f7e606169a025648abdd",
    "initialPayloads": [
      {
        "id": 193,
        "chainId": 1,
        "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
      }
    ],
    "snapshotBlockHash": "0x22eb98670bf312c55cd684873c5e03990e11d7b0d4b003cb87b20aac059ed1a8",
    "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
    "canceledAt": 0,
    "votingActivationTime": 1729345307,
    "votingChainId": 137,
    "votingMachineData": {
      "id": 185,
      "forVotes": "826787985207859760503894",
      "againstVotes": "0",
      "startTime": 1729346402,
      "endTime": 1729605602,
      "votingClosedAndSentBlockNumber": 63353672,
      "votingClosedAndSentTimestamp": 1729605612,
      "l1BlockHash": "0x22eb98670bf312c55cd684873c5e03990e11d7b0d4b003cb87b20aac059ed1a8",
      "strategy": "0x59e6CAD5d7E7b9A26a45a1d1E74C7aF008170042",
      "sentToGovernance": true,
      "createdBlock": 63232723,
      "votedInfo": {
        "support": false,
        "votingPower": "0"
      },
      "votingAssets": [
        "0x7Fc66500c84A76Ad7e9c93437bFc5Ac33E2DDaE9",
        "0x4da27a545c0c5B758a6BA100e3a049001de870f5",
        "0xA700b4eB416Be35b2911fd5Dee80678ff64fF6C9"
      ],
      "hasRequiredRoots": true
    },
    "isFinished": true,
    "lastUpdatedTimestamp": 1730884017,
    "cancellationFee": 50000000000000000
  }
}