{
  "payloads": [
    {
      "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
      "maximumAccessLevelRequired": 1,
      "state": 2,
      "createdAt": 1740570635,
      "queuedAt": 1740918785,
      "executedAt": 0,
      "cancelledAt": 0,
      "expirationTime": 1743594635,
      "delay": 86400,
      "gracePeriod": 604800,
      "actions": [
        {
          "target": "0x5BF166C82849d2d12F3bC7116add22B81D689CeC",
          "withDelegateCall": true,
          "accessLevel": 1,
          "value": "0",
          "signature": "execute()",
          "callData": "0x"
        }
      ],
      "id": 67,
      "chainId": 10,
      "payloadsController": "0x0E1a3Af1f9cC76A62eD31eDedca291E63632e7c4"
    }
  ],
  "ipfs": {
    "ipfsHash": "QmW2XnbpfR73SH4dG5L5bHezykadbhEhw9HwXL7nqdAZGi",
    "description": "\n## Simple Summary\n\nThis proposal continues on the proposed steps from [this post](https://governance.aave.com/t/susd-depeg-update-05-16-2024/17719) by recommending the removal of sUSD as collateral on Aave V3’s Optimism. Additionally, we recommend reducing the LT and LTV of the Stablecoin E-Mode on Optimism, which sUSD is part of, and setting sUSD LTV to 0.\n\n## Motivation\n\nThis recommendation follows the recent proposal to reduce the supply and borrow cap of sUSD to 10m and 1, respectively; that adjustment follows a period of reduced sUSD DEX liquidity, which dropped to a buy-side low of $2M before recovering after the introduction of token incentives.\n\nDuring this period, shorting activity on sUSD was observed between January 9th and January 15th. Following the implementation of token incentives on January 16th, as detailed in [this announcement](https://x.com/synthetix_io/status/1878944713446924552), these short positions were closed, and new borrowing demand primarily originated from users farming the newly introduced incentives.\n\nBelow, we present a table of the current sUSD borrows on Aave and the associated strategy exposure. The distribution of such strategies seems to be quite dispersed, with the recent incentive structure leading to demand to create perpetual positions on Synthetix coupled with liquidity pool growth rather than short positions.\n\n| User                                       | Action  | Size | Date            |\n| ------------------------------------------ | ------- | ---- | --------------- |\n| 0xD8b88C185e06eBF8C58B7dc8b7AFf18304CdD888 | Short   | 350k | Jan 9 to Jan 15 |\n| 0x49bf093277bf4dde49c48c6aa55a3bda3eedef68 | LP      | 150k | 16th            |\n| 0x407cff84eeaacda390fe302c99fa5dd32521bc53 | Holding | 400k | 16th            |\n| 0xe31deacee1770dfa56f8849724bcb7f8e5f76ef2 | LP      | 130k | 16th            |\n| 0xf7ca1f0ff0995c84fef530f7c74c69fb80331e81 | Perp    | 200k | 16th            |\n| 0x9644a6920bd0a1923c2c6c1dddf691b7a42e8a65 | Perp+LP | 750k | 16th            |\n| 0xfd81b27d9796a1ba7d7171ea70010c9befb2a62a | Perp    | 380k | 17th            |\n\n### Peg Dynamics and Mechanism Design\n\nAn analysis of the peg and utilization dynamics revealed that the price deviation of sUSD can be attributed to a combination of multiple factors, including traders profiting from the Synthetix Perpetual platform, the lack of interest rate on sUSD debt in an environment of heightened rates, and the ongoing migration to Synthetix V3, which reduces demand for sUSD. This created an imbalance as this excess supply was not met with proportional demand, putting downward pressure on the price of sUSD. This conclusion is supported by the increase in sUSD’s market cap, which closely followed the downward price deviation and the growth in interest rates.\n\nWhile this behavior does not pose a risk to sUSD’s fundamental backing, the exit of sUSD’s price from its concentrated liquidity range reduced buy-side liquidity, thereby increasing Aave’s risk to sUSD positions. This liquidity constraint underpinned the recommendation to reduce caps, aiming to mitigate Aave’s risk.\n\n### Removing sUSD as Collateral\n\nWith the recent deterrence of the creation of new sUSD debt on Aave and continued minimized supply exposure, the majority of outstanding debt is fundamentally leveraged to explicitly contribute to the recent sUSD incentive programs by minimizing effective peg exposure. However, while highly overcollateralized, the current economics associated with the soft peg mechanism is fundamentally shaky; minimizing the usage of sUSD as collateral is recommended to be performed as a preventive measure. The current distribution of such sUSD-collateralized stablecoin debt positions is highly conservative, as can be seen below, thereby requiring a significant depeg to start contributing negatively to the Aave protocol, and the expectation is such that exposure will continue to be minimized over time, as has been the case with a 3M reduction in supply on Aave (25%) over the last 7 days.\n\nMoreover, during a swift depeg event 7 months ago, we proposed an immediate LTV0 change due to the deprecation of their spot synths contributing to significant downward pressure, as can be seen [here](https://governance.aave.com/t/susd-depeg-update-05-16-2024/17719). The fundamental characteristics of the asset eventually improved once more through mechanical changes on Synthetix’s side in the redemption process, leading to the unfreezing of the asset, as seen in [this](https://governance.aave.com/t/arfc-chaos-labs-parameter-recommendations-susd-on-v3-optimism-05-23-2024/17779) post. However, we continued to reduce exposure significantly in the form of decreasing caps, coupled with decreasing LTV/LTs in both the general market and E-Mode configuration, leading to a more conservative state. As such, a significant buffer of 6% price movement already exists between the collateral value at the LT and the bad debt threshold of 1/(1+LB) in e-mode itself.\n\n## Recommendation\n\nTo further improve this safety buffer and given the conservative distribution of collateralized debt positions throughout the stablecoin E-Mode config on Optimism, we recommend decreasing the LTV/LT in Stablecoins E-Mode while minimizing induced liquidations.\n\nConsidering the current positioning within the E-Mode, we estimate the optimal LT reduction to be 87%. While we intend to deprecate the E-Mode and remove sUSD from it progressively, this change poses an initial step in that direction. Chaos Labs will monitor the market and introduce additional Liquid E-Modes if demand for a stablecoin-correlated E-Mode remains.\n\nThe change to 87% LT is expected to cause the liquidation of $95K of collateral.\n\nThe liquidations caused at the recommended LT are primarily stablecoins with significant liquidity to support the minimal liquidation size, with sUSD liquidations only representing $2.4K, or 3.2%.\n\nAdditionally, we recommend setting the LTV of sUSD outside of the Stablecoin Correlated E-Mode to 0; this measure will prevent additional borrowing from being performed using sUSD as collateral, hence limiting the future risk posed by an sUSD downward deviation.\n\nThis measure will simultaneously apply to both sUSD parameters within and outside of the E-Mode, hence limiting the opening of new positions.\n\nFollowing an improvement of the sUSD peg and a reduction in sUSD-denominated collateral, Chaos Labs will reinstate the borrow cap to a defined value determined by our methodology.\n\n## Specification\n\nFor the sUSD asset on Aave V3 Optimism instance, we recommend the following:\n\n| Asset | Deployment | Current LTV | Rec. LTV |\n| ----- | ---------- | ----------- | -------- |\n| sUSD  | Optimism   | 60.00%      | 0.00%    |\n\nFor the Stablecoin E-Mode on Aave V3 Optimism instance, we recommend the following:\n\n| Parameter           | Current Value | Rec. Value |\n| ------------------- | ------------- | ---------- |\n| LTV                 | 90.00%        | 0.01%      |\n| LT                  | 93.00%        | 87.00%     |\n| Liquidation Penalty | 1.00%         | 1.00%      |\n\n## References\n\n- Implementation: [AaveV3Optimism](https://github.com/bgd-labs/aave-proposals-v3/blob/eb25966c4bb18234867074a741178bfacd3109cf/src/20250220_AaveV3Optimism_SUSDRiskParameterAdjustment/AaveV3Optimism_SUSDRiskParameterAdjustment_20250220.sol)\n- Tests: [AaveV3Optimism](https://github.com/bgd-labs/aave-proposals-v3/blob/eb25966c4bb18234867074a741178bfacd3109cf/src/20250220_AaveV3Optimism_SUSDRiskParameterAdjustment/AaveV3Optimism_SUSDRiskParameterAdjustment_20250220.t.sol)\n- [Snapshot](https://snapshot.box/#/s:aave.eth/proposal/0x5c744451272991c7fdf8b3830fa2a51fc18dd0e417d95d9c16da765b27f602ff)\n- [Discussion](https://governance.aave.com/t/arfc-susd-risk-parameter-adjustment/20793)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "title": "sUSD Risk Parameter Adjustment",
    "author": "Aave-Chan Initiative",
    "discussions": "https://governance.aave.com/t/arfc-susd-risk-parameter-adjustment/20793",
    "snapshot": "https://snapshot.box/#/s:aave.eth/proposal/0x5c744451272991c7fdf8b3830fa2a51fc18dd0e417d95d9c16da765b27f602ff",
    "originalIpfsHash": "0x723936aac15685cf6a4cb44f4252592631f5f0022953896cc51b57df418da6f7"
  },
  "proposal": {
    "id": 256,
    "votingDuration": 259200,
    "creationTime": 1740570683,
    "accessLevel": 1,
    "state": 4,
    "queuingTime": 1740918695,
    "ipfsHash": "0x723936aac15685cf6a4cb44f4252592631f5f0022953896cc51b57df418da6f7",
    "initialPayloads": [
      {
        "id": 67,
        "chainId": 10,
        "payloadsController": "0x0E1a3Af1f9cC76A62eD31eDedca291E63632e7c4"
      }
    ],
    "snapshotBlockHash": "0x40bd8a7d2e0e4918e736a643196b155306663564ec311c61220af68136481558",
    "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
    "canceledAt": 0,
    "votingActivationTime": 1740657131,
    "votingChainId": 137,
    "votingMachineData": {
      "id": 256,
      "forVotes": "820037223011296334777913",
      "againstVotes": "203795638885687213",
      "startTime": 1740658250,
      "endTime": 1740917450,
      "votingClosedAndSentBlockNumber": 68555941,
      "votingClosedAndSentTimestamp": 1740917464,
      "l1BlockHash": "0x40bd8a7d2e0e4918e736a643196b155306663564ec311c61220af68136481558",
      "strategy": "0x59e6CAD5d7E7b9A26a45a1d1E74C7aF008170042",
      "sentToGovernance": true,
      "createdBlock": 68434914,
      "votedInfo": {
        "support": false,
        "votingPower": "0"
      },
      "votingAssets": [
        "0x7Fc66500c84A76Ad7e9c93437bFc5Ac33E2DDaE9",
        "0x4da27a545c0c5B758a6BA100e3a049001de870f5",
        "0xA700b4eB416Be35b2911fd5Dee80678ff64fF6C9"
      ],
      "hasRequiredRoots": true
    },
    "isFinished": false,
    "lastUpdatedTimestamp": 1740961808,
    "cancellationFee": 50000000000000000
  }
}