{
  "payloads": [
    {
      "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
      "maximumAccessLevelRequired": 1,
      "state": 3,
      "createdAt": 1753358699,
      "queuedAt": 1753708979,
      "executedAt": 1753795403,
      "cancelledAt": 0,
      "expirationTime": 1756382699,
      "delay": 86400,
      "gracePeriod": 604800,
      "actions": [
        {
          "target": "0xd4b898881803B0ca6b798e62DA096FA831fC7418",
          "withDelegateCall": true,
          "accessLevel": 1,
          "value": "0",
          "signature": "execute()",
          "callData": "0x"
        }
      ],
      "id": 318,
      "chainId": 1,
      "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
    }
  ],
  "ipfs": {
    "ipfsHash": "QmWaHTTPSot2MavVV5PtPHrcbWGqFgWbqmuvXDcm4qsCpi",
    "description": "\n## Simple Summary\n\nThis proposal recommends enabling USDtb as a borrowable asset within the e-mode configuration for USDe PTs and adding sUSDe and PT-sUSDE-31JUL2025 as a collateral asset to the stablecoin e-mode configuration of PT-sUSDe-25SEP2025.\n\nThe integration of USDtb as a borrowable asset in the USDe PT e-mode is expected to drive borrowing demand and increase Aave protocol revenue. However, this setup introduces risks related to the rehypothecation of stablecoin backing used for USDe redemptions. These must be managed through careful parameterization.\n\n## **USDtb**\n\nUSDtb is a 1:1 USD-pegged stablecoin issued by Pallas (BVI) Ltd. and managed by Athene Management, an affiliate of Ethena Labs. It is primarily backed by BlackRock’s BUIDL, a tokenized U.S. Treasury fund, with a portion held in USDC to support redemption liquidity.\n\nMinting and redemption of USDtb are restricted to whitelisted addresses.\n\nUSDtb plays a central role in USDe’s stablecoin backing, enabling fast redemptions and real-world yield through U.S. Treasuries. It functions as a strategic reserve and yield-bearing asset within the Ethena ecosystem\n\n## **USDe Backing**\n\nEthena’s USDe is a synthetic dollar whose collateral mix dynamically adjusts based on funding rate conditions in the market. Its backing can consist of delta-neutral short perp positions and stablecoin reserves.\n\nHistorically, the stablecoin share of USDe’s backing has varied significantly, ranging from a low of 6% to a peak of 76%, and currently stands at approximately 45%.\n\nThe stablecoin portion (including USDtb) provides fast redemption liquidity. When redemptions occur, Ethena prefers using liquid stablecoin reserves rather than unwinding short perp positions, which may be labor intensive and costly in volatile market conditions.\n\n## Risks\n\nEnabling USDtb as a borrowable asset within USDe PT e-modes introduces several important risk vectors that should be carefully considered.\n\n### **Rehypothecation and Liquidity Risk in Stress Scenarios**\n\nUSDtb serves as a redemption reserve in the Ethena ecosystem, ensuring timely and reliable USDe redemptions. Allowing it to be borrowed by PT loopers introduces a reflexive dynamic: low borrow rates incentivize PT looping, which drives further new USDe minting and results in more USDtb being minted and deposited into Aave. This increases supply side liquidity, keeps borrow rates low, and reinforces the loop. If left unchecked, this rehypothecation cycle can lead to unsustainable expansion of USDe supply, amplifying systemic risk during periods of market stress or liquidity shocks.\n\nThis structure presents a significant risk in stress scenarios. In the event of large-scale redemptions, such as those triggered by a centralized exchange failure, Ethena requires immediate access to its USDtb reserves to honor redemptions and to rehedge or unwind short positions.\n\nHowever, if a substantial portion of USDtb is borrowed out by PT loopers, Ethena may be unable to retrieve its liquidity. As shown in our recent analysis [Stress Testing Ethena: A Quantitative Look at Protocol Stability](https://governance.aave.com/t/stress-testing-ethena-a-quantitative-look-at-protocol-stability/22558), under such conditions, PT leverage loopers may be unable to unwind their positions due to a lack of available onchain liquidity, preventing repayment of borrowed USDtb. This results in a liquidity mismatch that can delay or block redemptions, undermining Ethena’s ability to respond effectively and increasing the risk of instability in the USDe peg during periods of market stress.\n\nIt is also important to note that USDtb generates real world yield through its exposure to tokenized U.S. Treasuries. If Ethena is both earning this yield and simultaneously supplying USDtb to Aave to earn additional supply side returns, while Aave bears the counterparty and liquidation risks from borrowers, it creates an asymmetry in risk and reward. Without adjustments to reserve factors or appropriate risk parameters, Aave may be exposed to these risks without being adequately compensated.\n\n## **Benefits to Aave**\n\nDespite the associated risks, enabling USDtb borrowing for PT-based strategies offers several important benefits for Aave.\n\n### **Increased Borrowing Demand and Protocol Revenue**\n\nUSDtb is expected to become one of the preferred borrowing asset for users engaging in USDe PT looping strategies. This will drive significant borrowing activity, increasing the utilization of USDtb deposits on Aave. As a result, the protocol stands to benefit from higher interest rate income.\nBelow, we outline the expected revenue derived from the borrowing of USDtb in relation to the amount of USDtb borrowed against PT collaterals and aUSDtb’s share of the total USDe backing.\n\n### **Potential Indirect Contribution to Risk Reduction**\n\nAs highlighted in our [_Stress Testing Ethena: A Quantitative Look at Protocol Stability_](https://governance.aave.com/t/stress-testing-ethena-a-quantitative-look-at-protocol-stability/22558/1) analysis, the proportion of stablecoin backing in USDe plays a key role in determining how much USDe must depeg before Aave incurs bad debt. We observed that an increased stablecoin share significantly reduces Aave’s exposure to losses through USDe base assets in the event of exchange failure scenario. If USDtb becomes borrowable on Aave, it creates an additional income stream for Ethena, allowing them to earn both U.S. Treasury yield and Aave supply yield. This additional yield may incentivize Ethena to maintain a higher stablecoin allocation in USDe’s backing, indirectly reducing risk to Aave.\n\nHowever, this effect is difficult to predict, as it introduces a new dynamic into the system. While our analysis shows that the stablecoin share in USDe’s reserve has historically been driven primarily by market funding rates, not by onchain stablecoin yield opportunities. Enabling USDtb to generate additional onchain yield may influence reserve allocation behavior in ways not previously observed.\n\n## **Risk Mitigations on Aave**\n\nTo safely support USDtb as a borrowable asset within USDe PT e-modes, Aave can adopt several mitigation strategies to limit protocol risk and preserve market stability.\n\n### **Borrow Cap Controls**\n\nAave can limit rehypothecation risk by applying a conservative borrow cap on USDtb, ensuring that only a portion of the supply is made available for borrowing. The goal is to prevent the borrow cap from growing beyond a prudent fraction of Ethena’s stablecoin reserves, helping ensure that a meaningful portion of USDtb remains accessible for redemptions and liquidity management during periods of stress.\n\n### **Interest Rate Adjustments**\n\nAave can adjust interest rate parameters not only to mitigate systemic risks but also to optimize the protocol’s risk-reward profile. We recommend two complementary mechanisms: dynamic adjustments based on USDe reserve composition and proactive curve optimization to improve the protocol’s risk-reward profile.\n\n#### **Dynamic Adjustments Based on USDe Stablecoin Reserve Composition**\n\nIn scenarios where borrowing demand for USDtb exceeds safe thresholds, Aave can dynamically adjust the variable interest rate curve to discourage further exposure. Here, _safe thresholds_ refer to the level at which the amount of USDtb borrowed on Aave begins to represent an outsized share of the stablecoin portion of USDe backing. Steepening the slope parameters at or beyond the optimal utilization point can effectively reduce excessive borrowing activity and help maintain balanced market dynamics.\nInterest rate adjustments are particularly useful in the following cases:\n\n1. **Declining Stablecoin Backing:** If Ethena reduces the stablecoin portion of USDe’s backing while USDtb borrowing on Aave remains elevated at the borrow cap, interest rates can be raised to keep borrowed USDtb within a prudent share of the reduced stablecoin reserve.\n2. **Shrinking USDe Supply:** If USDe supply is contracting but borrowed USDtb does not decrease accordingly, interest rate hikes can be used to dampen excessive exposure and ensure that borrowing demand remains proportionate to the size of the stablecoin reserve.\n\nThis approach gives Aave a flexible tool to align borrowing rates with underlying liquidity conditions and systemic safety.\n\n#### **Interest Rate Curve Optimization**\n\nTo better align revenue generation with Aave’s risk exposure, we also recommend updating the USDtb interest rate model by introducing a 2% base rate and reducing slope-1 from 6% to 4%. This adjustment enables Aave to begin accruing protocol income earlier in the utilization curve, improving yield efficiency while keeping borrowing costs competitive for users.\n\nBy shifting more revenue generation into the sub-optimal utilization range, Aave can enhance protocol earnings without disincentivizing strategic borrowing behavior. Slope-2 and Uoptimal remain unchanged, maintaining tail risk protection in high utilization scenarios.\n\nThis proactive optimization improves the protocol’s risk-reward balance, and ensures Aave captures more value from growing borrowing demand.\n\n### **Reserve Factor Optimization**\n\nAave can increase the reserve factor on USDtb to better align risk and reward. Given that Ethena may capture yield from both the underlying U.S. Treasuries and Aave’s supply rate, the protocol should retain a larger portion of interest payments as a buffer against potential losses. This improves the risk-reward profile for Aave and allows the protocol to accumulate reserves proportional to its exposure.\nTogether, these controls provide Aave with levers to manage systemic risk, support healthy market behavior, and ensure that enabling USDtb borrowing does not come at the cost of protocol resilience.\n\n## sUSDe E-Mode Collateral\n\nThe PT-sUSDE-31JUL2025 is scheduled to expire on 31 July, just 13 days from now. To ensure a smooth migration path for existing suppliers of PT-sUSDE-31JUL2025, we propose including the base asset sUSDe and the PT relative to the expiring E-Mode in the stablecoin E-Mode of PT-sUSDE-25SEP2025 as collateral.\n\nThis modification provides a smooth path for users to roll over their existing positions to the new expiry, should they choose to do so.\n\nThis change aligns with the approach outlined in the following ARFC:\n\n[ARFC Addendum – Modify E-Modes for PT Token Collateral](https://governance.aave.com/t/arfc-addendum-modify-e-modes-for-pt-token-collateral/22128)\n\n## Specification\n\nThefollowing assets will be added to **PT-sUSDE September Stablecoins E-mode**\n\n| **Asset**  | **PT-sUSDE-31JUL2025** | **sUSDe** | **USDtb** |\n| ---------- | ---------------------- | --------- | --------- |\n| Collateral | Yes                    | Yes       | No        |\n| Borrowable | No                     | No        | Yes       |\n\n## References\n\n- Implementation: [AaveV3Ethereum](https://github.com/bgd-labs/aave-proposals-v3/blob/0d3197966d3fa18914f5242d983c9d9d774f5bcf/src/20250721_AaveV3Ethereum_AmendPTSUSDeSeptemberStablecoinEmode/AaveV3Ethereum_AmendPTSUSDeSeptemberStablecoinEmode_20250721.sol)\n- Tests: [AaveV3Ethereum](https://github.com/bgd-labs/aave-proposals-v3/blob/0d3197966d3fa18914f5242d983c9d9d774f5bcf/src/20250721_AaveV3Ethereum_AmendPTSUSDeSeptemberStablecoinEmode/AaveV3Ethereum_AmendPTSUSDeSeptemberStablecoinEmode_20250721.t.sol)\n- Snapshot: Direct-to-AIP\n- [Discussion](https://governance.aave.com/t/direct-to-aip-adjustment-of-pt-susde-september-e-mode-and-usdtb-ir-curve/22615)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "title": "amend PT-sUSDe september stablecoin emode",
    "author": "Aave-Chan Initiative",
    "discussions": "https://governance.aave.com/t/direct-to-aip-adjustment-of-pt-susde-september-e-mode-and-usdtb-ir-curve/22615",
    "originalIpfsHash": "0x7a5b98aa1030964b1ba754fc35d2e3d3e17549c97ee82977d6a5fc56d8fd198b"
  },
  "proposal": {
    "id": 341,
    "votingDuration": 259200,
    "creationTime": 1753358987,
    "accessLevel": 1,
    "state": 4,
    "queuingTime": 1753708967,
    "ipfsHash": "0x7a5b98aa1030964b1ba754fc35d2e3d3e17549c97ee82977d6a5fc56d8fd198b",
    "initialPayloads": [
      {
        "id": 318,
        "chainId": 1,
        "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
      }
    ],
    "snapshotBlockHash": "0x61133d5cda6d6d449ca35aeafaed3266845d17d609d72cda37b63d7a6414f1ec",
    "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
    "canceledAt": 0,
    "votingActivationTime": 1753445411,
    "votingChainId": 137,
    "votingMachineData": {
      "id": 341,
      "forVotes": "443263808418784610668158",
      "againstVotes": "21795998985239210931",
      "startTime": 1753448603,
      "endTime": 1753707803,
      "votingClosedAndSentBlockNumber": 74514508,
      "votingClosedAndSentTimestamp": 1753707812,
      "l1BlockHash": "0x61133d5cda6d6d449ca35aeafaed3266845d17d609d72cda37b63d7a6414f1ec",
      "strategy": "0xd755F1CA351E989391a5bacDeC8F780dFD76f5d2",
      "sentToGovernance": true,
      "createdBlock": 74392826,
      "votedInfo": {
        "support": false,
        "votingPower": "0"
      },
      "votingAssets": [
        "0x7Fc66500c84A76Ad7e9c93437bFc5Ac33E2DDaE9",
        "0x4da27a545c0c5B758a6BA100e3a049001de870f5",
        "0xA700b4eB416Be35b2911fd5Dee80678ff64fF6C9"
      ],
      "hasRequiredRoots": true
    },
    "isFinished": true,
    "lastUpdatedTimestamp": 1761458863,
    "cancellationFee": 50000000000000000
  }
}