{
  "payloads": [
    {
      "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
      "maximumAccessLevelRequired": 1,
      "state": 3,
      "createdAt": 1751437811,
      "queuedAt": 1751791847,
      "executedAt": 1751980931,
      "cancelledAt": 0,
      "expirationTime": 1754461811,
      "delay": 86400,
      "gracePeriod": 604800,
      "actions": [
        {
          "target": "0x5355336aaF7DbB6E67C2237a9D0d0d7A3f96d0b3",
          "withDelegateCall": true,
          "accessLevel": 1,
          "value": "0",
          "signature": "execute()",
          "callData": "0x"
        }
      ],
      "id": 312,
      "chainId": 1,
      "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
    }
  ],
  "ipfs": {
    "ipfsHash": "QmXidnYaBRgf2upUTktpB9oLcv2voQAPtjsuSYCfw6MZnA",
    "description": "\n## Simple Summary\n\nTo maximize the impact of GHO’s upcoming listings on Bybit, Bitget, and other centralized exchanges (CEXs), this publication proposes engaging a market maker to provide spot liquidity and allocating funds to a CEX Earn program to drive broader adoption of GHO.\n\n## Motivation\n\nListing GHO on centralized exchanges serves as a strategic lever to broaden its adoption by tapping into a wider and more diverse user base. It opens a powerful new distribution channel, allowing the Aave DAO to strengthen GHO’s market presence and accelerate its global reach.\n\n- Expanded Audience: Access to retail and institutional users who primarily operate on CEXs and are less familiar with decentralized and on-chain stablecoins.\n- New Utility: Enables GHO to be used as collateral in perpetual contracts and other financial products not currently available within DeFi.\n- Enhanced Liquidity and Visibility: CEX listings improve global accessibility and strengthen GHO’s brand recognition through higher trading volumes and broader market exposure.\n\nWhile several stablecoins are already entrenched on centralized platforms, GHO’s success will hinge on delivering a compelling value proposition that differentiates it from more established alternatives. By leveraging the Aave Protocol as a native yield engine, GHO can replicate the successful strategies of stablecoins like USDtb and USDe, channeling yield from the GSMs directly to CEX users, incentivizing them to hold and use GHO.\n\n#### Earn Campaign Structure\n\nTo accelerate GHO’s adoption, we propose a user acquisition incentive that rewards users for simply holding GHO on the CEX—regardless of how or where it’s used on the platform. This mechanism mirrors the experience of depositing into an on-chain Earn vault, allowing users to earn yield passively while maintaining full flexibility.\n\nBy offering native yield on CEX-held GHO, we aim to drive broader usage across the exchange’s ecosystem—spanning spot, derivatives, and Earn products—while positioning GHO as a competitive and attractive alternative to existing stablecoins.\n\nThe GHO Earn Campaign offers the following features:\n\n- sGHO-style Airdrop Model: A proxy system that tracks GHO balances on participating CEXs and rewards users on a weekly basis, mimicking the on-chain sGHO model.\n- Incentives Distribution: Rewards will be distributed based on GHO balances held in eligible accounts on partner exchanges. Users will receive a weekly airdrop direct to their balance to create a savings account user experience.\n\nThis model encourages sustained holding of GHO while aligning with familiar incentive mechanisms used in CEX environments.\n\nBy offering a competitive yield that accelerates GHO’s broad adoption, we are able to advocate for further integrations beyond spot trading and Earn Platforms. Through offering greater utility such as Margin trading and Perpertuals, we expect to achieve higher retention rates when rewards are reduced.\n\n#### Funding\n\nThe Earn program’s yield is expected to exceed the Aave Protocol deposit rate and be competitive compared to other offerings in the market.\n\nIn administering the program, GHO holders will received GHO airdrop to them each week. Users receive a fixed yield that is adjusted on a weekly cadence to be loosely correlated with the broader market. ie: Week 1 could be 6% and Week 2 could be 6.25%. However, to limit budget exposure there is a TVL target, once which once exceeded the yield is diluted to avoid over-spending.\n\nWhile Aave generates revenue from the GSMs and in parallel distributes GHO to CEX users, there are both timing considerations and differences in yields to consider. By creating a separate budget, this streamlines the operational burden for sustaining the program. Revenue generated by the GSMs will accumulate independent of the rewards being distributed.\n\nThe true cost of the program is the difference between revenue generated from the new GHO circulating supply and the rewards distributed to bootstrap GHO across the CEXs. TokenLogic will provide a dashboard to track overall spend and revenue generated from activities linked to this program.\n\nTo execute this initiative, we are requesting a funding allocation of 5M GHO from the DAO treasury to be used for:\n\n- Weekly rewards distribution (denominated in GHO or an equivalent stable asset).\n- Technical integration and CEX collaboration costs.\n- Marketing support to promote GHO onboarding and listings.\n\nProposed budget: `5M GHO` over a 4 to 6 month period.\n\n## Specification\n\nThe initial Allowance is for 5M aEthLidoGHO from the Prime instance.\n\nAsset: aEthLidoGHO `0x18eFE565A5373f430e2F809b97De30335B3ad96A`\nAmount: 5M\nSpender: AFC `0x22740deBa78d5a0c24C58C740e3715ec29de1bFa`\n\nMethod: approve() aEthLidoGHO on the Aave Collector contract to the AFC address.\n\nTo facilitate the program, the following assets are to be swapped for GHO.\n\n| Ethereum | Amount | Swap |\n| -------- | ------ | ---- |\n| USDT     | 2.50M  | GHO  |\n| USDC     | 2.50M  | GHO  |\n\n## References\n\n- Implementation: [AaveV3EthereumLido](https://github.com/bgd-labs/aave-proposals-v3/blob/353b2d55e83a61902a49928aeeb0c1b6309e00a2/src/20250625_AaveV3EthereumLido_CEXEarnFundingProposal/AaveV3EthereumLido_CEXEarnFundingProposal_20250625.sol)\n- Tests: [AaveV3EthereumLido](https://github.com/bgd-labs/aave-proposals-v3/blob/353b2d55e83a61902a49928aeeb0c1b6309e00a2/src/20250625_AaveV3EthereumLido_CEXEarnFundingProposal/AaveV3EthereumLido_CEXEarnFundingProposal_20250625.t.sol)\n- [Snapshot](https://snapshot.box/#/s:aavedao.eth/proposal/0xa390fb9061fd689a5d93519a7a9dae23d76b4010b3eea6aaedc70ea7aaed9310)\n- [Discussion](https://governance.aave.com/t/arfc-gho-cex-earn-incentive-program/22284)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "title": "CEX Earn Funding Proposal",
    "author": "@TokenLogic",
    "discussions": "https://governance.aave.com/t/arfc-gho-cex-earn-incentive-program/22284",
    "snapshot": "https://snapshot.box/#/s:aavedao.eth/proposal/0xa390fb9061fd689a5d93519a7a9dae23d76b4010b3eea6aaedc70ea7aaed9310",
    "originalIpfsHash": "0x8b5aea7c778b9b4a2367ae2ffd6ad34f21aeb899933b28353ef5f0cca6c5f4eb"
  },
  "proposal": {
    "id": 336,
    "votingDuration": 259200,
    "creationTime": 1751437859,
    "accessLevel": 1,
    "state": 4,
    "queuingTime": 1751791835,
    "ipfsHash": "0x8b5aea7c778b9b4a2367ae2ffd6ad34f21aeb899933b28353ef5f0cca6c5f4eb",
    "initialPayloads": [
      {
        "id": 312,
        "chainId": 1,
        "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
      }
    ],
    "snapshotBlockHash": "0xb56049fb5aa991eeaa0e8087987c9ca8183877ab66a05ae100148cd5056085a7",
    "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
    "canceledAt": 0,
    "votingActivationTime": 1751524283,
    "votingChainId": 137,
    "votingMachineData": {
      "id": 336,
      "forVotes": "456241938770505543324890",
      "againstVotes": "2032632717241436605835",
      "startTime": 1751531503,
      "endTime": 1751790703,
      "votingClosedAndSentBlockNumber": 73641752,
      "votingClosedAndSentTimestamp": 1751790711,
      "l1BlockHash": "0xb56049fb5aa991eeaa0e8087987c9ca8183877ab66a05ae100148cd5056085a7",
      "strategy": "0xd755F1CA351E989391a5bacDeC8F780dFD76f5d2",
      "sentToGovernance": true,
      "createdBlock": 73520075,
      "votedInfo": {
        "support": false,
        "votingPower": "0"
      },
      "votingAssets": [
        "0x7Fc66500c84A76Ad7e9c93437bFc5Ac33E2DDaE9",
        "0x4da27a545c0c5B758a6BA100e3a049001de870f5",
        "0xA700b4eB416Be35b2911fd5Dee80678ff64fF6C9"
      ],
      "hasRequiredRoots": true
    },
    "isFinished": true,
    "lastUpdatedTimestamp": 1759806967,
    "cancellationFee": 50000000000000000
  }
}