{
  "payloads": [
    {
      "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
      "maximumAccessLevelRequired": 1,
      "state": 2,
      "createdAt": 1713804059,
      "queuedAt": 1714152347,
      "executedAt": 0,
      "cancelledAt": 0,
      "expirationTime": 1716828059,
      "delay": 86400,
      "gracePeriod": 604800,
      "actions": [
        {
          "target": "0x075d8C4AEC8e3aCc7b3689E064D838ca8bB07E5C",
          "withDelegateCall": true,
          "accessLevel": 1,
          "value": "0",
          "signature": "execute()",
          "callData": "0x"
        }
      ],
      "id": 109,
      "chainId": 1,
      "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
    }
  ],
  "ipfs": {
    "ipfsHash": "QmbW6QKACcwfouvNmzT1NzjQ1mynK6mDRXpeiUskbftSyH",
    "description": "\n## Simple Summary\n\nChaos Labs proposes an amendment to our current scope of work and compensation structure accordingly. Chaos Labs is requesting a $400,000 increase, bringing our total annual compensation to $2M.\n\n## Motivation\n\nIn November 2023, Chaos Labs’ engagement with Aave DAO was [unanimously renewed](https://governance-v2.aave.com/governance/proposal/360/), underscoring our ongoing commitment and the expanded scope of our engagement with Aave, which has evolved significantly with Aave’s expansion now across over 10 deployments.\n\nThis renewal was done during the bear market, prompting us to propose a community-friendly deal at a lower-than-market cost, given the challenging market conditions and being mindful of the broader economic environment. This was aligned with the feedback from major Aave stakeholders and delegates. However, the expansion of Aave to multiple chains, in addition to the increased volatility and activity across DeFi and crypto, has significantly increased our scope and workload, necessitating additional resources to maintain the high level of service required.\n\nAs dedicated risk contributors, Chaos Labs adopts a holistic approach to managing the spectrum of responsibilities within Aave’s ecosystem, including V3, GHO, and the continued offboarding of V2. Our commitment encompasses risk management, data science, analytics, and parameter recommendation, among other critical functions. An amendment to our compensation is essential to reflect better the resources committed, the depth of our engagement, and the substantial value we bring to the Aave community.\n\nConsidering improved market conditions and Aave’s growth over the past several months, we believe the DAO is now in a position to revise our compensation to more accurately reflect the current scale and impact of our engagement and allocated resources.\n\n### Enhancing Aave’s Risk Management Framework\n\nThe proposed compensation amendment is not merely a financial adjustment but a continued investment in our collaboration. With additional funding, Chaos Labs will be poised to:\n\n- **Deploy Additional Resources:** Enhance support for existing and future Aave markets, ensuring comprehensive risk management across all deployments.\n- **Develop and Optimize Risk Oracles:** Focus efforts on the continued development of the Chaos Risk Oracle specifically for Aave’s needs, enabling more efficient and dynamic risk parameter adjustments. This will further streamline the risk management process, reducing the need for manual interventions and significantly boosting the protocol’s operational efficiency and security.\n- **Expansion of Risk Monitoring and Alerts:** Our real-time monitoring and alert services are delivered via the [Chaos Labs Risk Monitoring Platform](https://community.chaoslabs.xyz/aave-v2/risk/overview). We’re committed to enriching these services with more comprehensive analytics and alerts, enhancing visibility and enabling users to meticulously evaluate ecosystem risks and the health of the protocol through intuitive dashboards and data visualizations. The deployment of Risk Oracles will introduce additional data, providing the community with an improved grasp of risk levels and updates to protocol parameters.\n\n### Collaborative Expansion with a Second Risk Service Provider\n\nFollowing Gauntlet’s resignation as the second-risk service provider, we strongly support the idea of bringing on another service provider to complement our existing scope of work. As part of our engagement, we are committed to dedicating the required resources to assist with the onboarding process and ongoing collaborations, ensuring a seamless integration that enhances Aave’s risk management capabilities without duplicating efforts.\n\n### Conclusion\n\nThe requested compensation amendment is key for Chaos Labs to sustain and expand its support for Aave. It will enable us to allocate additional resources effectively, develop innovative solutions like the Risk Oracle, and continue our mission to enhance Aave’s security and efficiency. We are committed to our partnership with Aave and believe that with the community’s support, we can continue setting the standards for risk management in the industry.\n\n## Specification\n\nWe request an additional $400K for the remainder of our current engagement, bringing the total annual compensation to $2M.\n\nIf this proposal is approved, a stream of the allocated budget will be activated, with a Chaos Labs-controlled account (0xbC540e0729B732fb14afA240aA5A047aE9ba7dF0) as the recipient.\n\nIn terms of technical implementation, the AIP will call the createStream() method of the IAaveEcosystemReserveController interface to create a stream of 400,000 aUSDC or GHO.\n\n## Disclaimer\n\nChaos Labs provides ongoing risk management services to several other borrowing/lending protocols, such as Benqi, Venus, Tapioca, and more. These commitments do not interfere with our responsibilities concerning our association with Aave. We conscientiously provide explicit disclaimers and relevant context in any proposals that may influence clientele across the DeFi ecosystem.\n\nThis proposal was not commissioned or paid for by any third party.\n\n## References\n\n- Implementation: [AaveV3Ethereum](https://github.com/bgd-labs/aave-proposals-v3/blob/7d467002155ba0b1d30cb77780169dc268662f4e/src/20240415_AaveV3Ethereum_ChaosLabsEngagementAmendment/AaveV3Ethereum_ChaosLabsEngagementAmendment_20240415.sol)\n- Tests: [AaveV3Ethereum](https://github.com/bgd-labs/aave-proposals-v3/blob/7d467002155ba0b1d30cb77780169dc268662f4e/src/20240415_AaveV3Ethereum_ChaosLabsEngagementAmendment/AaveV3Ethereum_ChaosLabsEngagementAmendment_20240415.t.sol)\n- [Snapshot](https://snapshot.org/#/aave.eth/proposal/0x34b6cf5bc9c8a0525c5b32d4ce2ca2ccfce39d15bd0aba5cab46a4e9e78f3ea8)\n- [Discussion](https://governance.aave.com/t/arfc-chaos-labs-engagement-amendment/17324)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "title": "Chaos Labs Engagement Amendment",
    "author": "Chaos Labs",
    "discussions": "https://governance.aave.com/t/arfc-chaos-labs-engagement-amendment/17324",
    "originalIpfsHash": "0xc3933570aa757db7e941c51b9bf486f0cf17bcb38c1b95a9293fde7f5118259c"
  },
  "proposal": {
    "id": 85,
    "votingDuration": 259200,
    "creationTime": 1713804155,
    "accessLevel": 1,
    "state": 4,
    "queuingTime": 1714152323,
    "ipfsHash": "0xc3933570aa757db7e941c51b9bf486f0cf17bcb38c1b95a9293fde7f5118259c",
    "initialPayloads": [
      {
        "id": 109,
        "chainId": 1,
        "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
      }
    ],
    "snapshotBlockHash": "0x17d9a6d84d8695f45c4d8b35cb629a654ca0c4e4644f583ef03067de17819c2d",
    "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
    "canceledAt": 0,
    "votingActivationTime": 1713890591,
    "votingChainId": 137,
    "votingMachineData": {
      "id": 85,
      "forVotes": "372044948905090971863854",
      "againstVotes": "0",
      "startTime": 1713891820,
      "endTime": 1714151020,
      "votingClosedAndSentBlockNumber": 56281761,
      "votingClosedAndSentTimestamp": 1714151028,
      "l1BlockHash": "0x17d9a6d84d8695f45c4d8b35cb629a654ca0c4e4644f583ef03067de17819c2d",
      "strategy": "0x59e6CAD5d7E7b9A26a45a1d1E74C7aF008170042",
      "sentToGovernance": true,
      "createdBlock": 56169324,
      "votedInfo": {
        "support": false,
        "votingPower": "0"
      },
      "votingAssets": [
        "0x7Fc66500c84A76Ad7e9c93437bFc5Ac33E2DDaE9",
        "0x4da27a545c0c5B758a6BA100e3a049001de870f5",
        "0xA700b4eB416Be35b2911fd5Dee80678ff64fF6C9"
      ],
      "hasRequiredRoots": true
    },
    "isFinished": false,
    "lastUpdatedTimestamp": 1714177281,
    "cancellationFee": 50000000000000000
  }
}