{
  "payloads": [
    {
      "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
      "maximumAccessLevelRequired": 1,
      "state": 3,
      "createdAt": 1741007987,
      "queuedAt": 1741356023,
      "executedAt": 1741442507,
      "cancelledAt": 0,
      "expirationTime": 1744031987,
      "delay": 86400,
      "gracePeriod": 604800,
      "actions": [
        {
          "target": "0x09b9a2D4190668cD53D66ef60243C93c8538DeEc",
          "withDelegateCall": true,
          "accessLevel": 1,
          "value": "0",
          "signature": "execute()",
          "callData": "0x"
        },
        {
          "target": "0xF64a47956eCd99f8Cd0495fc2B15051D33d3a893",
          "withDelegateCall": true,
          "accessLevel": 1,
          "value": "0",
          "signature": "execute()",
          "callData": "0x"
        }
      ],
      "id": 254,
      "chainId": 1,
      "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
    },
    {
      "creator": "0x02fEb744cA516FD6E41D940Ae2d0F7Cb6FCB1ac3",
      "maximumAccessLevelRequired": 1,
      "state": 3,
      "createdAt": 1739488007,
      "queuedAt": 1741356903,
      "executedAt": 1741443546,
      "cancelledAt": 0,
      "expirationTime": 1742512007,
      "delay": 86400,
      "gracePeriod": 604800,
      "actions": [
        {
          "target": "0x115eD8ff4Eec1A02bB74056460FCaD2557870a8c",
          "withDelegateCall": true,
          "accessLevel": 1,
          "value": "0",
          "signature": "execute()",
          "callData": "0x"
        }
      ],
      "id": 16,
      "chainId": 324,
      "payloadsController": "0x2E79349c3F5e4751E87b966812C9E65E805996F1"
    }
  ],
  "ipfs": {
    "ipfsHash": "QmcmfsNpYY4nTXygfUusCxELTFvohjfR1zp7Yeds6Fv9Wk",
    "description": "\n## Simple Summary\n\nThis proposal suggests hardcoding the USDe price to match the USDT price in Aave’s pricing feeds. By linking USDe’s value directly to USDT, we align the sUSDe oracle with USDT pricing, ensuring seamless integration and avoiding disruptions caused by transient price fluctuations in USDe.\n\n_This proposal has been authored by @ChaosLabs in collaboration with @LlamaRisk, whho provided their support and analysis._\n\n## Motivation\n\nAave’s current pricing oracle for sUSDe integrates Chainlink’s USDe/USD market price feed. This setup exposes the sUSDe-backed positions to USDe’s secondary market price deviations. While the setup adopted by Ethena for USDe makes this volatility unlikely, if it were to happen, it would present liquidation risks for Aave users and the protocol itself.\n\nModeling indicates that a USDe price deviation of 5% could render approximately $300M of USDe-backed positions eligible for liquidation. However, with market liquidity constrained to support liquidations of only $6M within a 4% price impact (equal to the liquidation bonus), the majority of these liquidations would likely not be executed as unprofitable for liquidators, potentially causing bad debt to Aave.\n\nHistorical data suggests that USD redemptions act as a stabilizing force during such depegs, quickly restoring USDe’s peg and reducing liquidatable positions. Despite this stabilizing mechanism, the reliance on USDe’s secondary market price feed introduces unnecessary risk to Aave’s users.\n\n### **Mint and Redeem Functionality**\n\nThe minting and redeeming of USDe are facilitated through **EthenaMinting** contracts, which ensure atomic transactions exclusively for whitelisted addresses. These users, businesses or individuals who have passed KYC, interact with Ethena’s API to request a price quote and signature, verifying the validity of each order. The atomic process ensures smooth execution but grants Ethena the ability to deny requests that could harm the asset’s backing or if significant price fluctuations occur before execution. The contracts support a limited selection of assets, including stETH, ETH, WETH, mETH, DAI, USDT, USDC, and wBETH, with USDT dominating minting activity, accounting for over 84% of transactions since July.\n\nThe process handles daily outflows of up to $100 million without issues. With its withdraw patterns aligning with downward deviations in USDe’s price. Ethena maintains a withdrawal buffer of $30M USDT in the Mint/Redeem contract, replenished promptly after significant outflows. Over the last 100 instances of the buffer dropping below $28M, the median replenishment time was 36 seconds or 3 blocks. In addition to the quick replenishment, there is currently a 2M$ per block redeem limit. The combination of the two parameters ensures that that the Ethena team has sufficent time to perform market operations and close the short hedges.\n\nDuring a notable stress test on September 2, 2024, Abraxas Capital Management redeemed $100M USDe in 20 minutes through consecutive maximum-value transactions. This drained the reserves temporarily, but the buffer was restored to $30M within 25 minutes, demonstrating the system’s robustness.\n\nFollowing the event, we have found Ethena to be proactive to funding rate changes by increasing the share of USDe backing held as USDT available for withdraws. In the following chart, its possible to see the increase in Cash at hand following the drop in funding rate on Binance for ETH and coinciding with an increase in USDe redeems\n\nFees for minting and redeeming average 0.1% for amounts exceeding $10,000, incentivizing arbitrage when USDe prices deviate below $0.999 or above $1.001.\nFor assets below a certain threshold, the fee seems to be fixed to a nominal amount, making small redeems inefficient and costly.\n\nThe outliers visible after the 100,000$ mark are derived by changes in quote prices rather than fees.\n\nThe redeemer whitelist includes 180 addresses, with over 50% of activity attributed to three addresses. Notably, the biggest address frequently conducts arbitrage operations, executing multiple transactions per minute with an average size of $500K USDT. Recently, another address emerged as a key player, averaging $109,640 USDT per redemption via CowSwap whenever USDe dips below $0.999, aligning precisely with arbitrage expectations given fee structures.\n\n### **Funding Rate Dynamics**\n\nHistorically, ETH and BTC’s funding rates have displayed a strong positive bias, with only 10.34% of days yielding negative funding when incorporating stETH yields.\n\nEthena’s Insurance Fund further enhances the safety of this system, stepping in to cover instances of negative funding. While the Insurance Fund does not currently grow from a share of the accrued yield as described in the docs, the current size of $60M is sufficent to witstand over 70 days of the bottom 10 percentile funding rate with the current TVL.\n\nWhile the negative funding rate poses a risk to USDe backing, it also acts as an incentive for the protocol to remain healthy and automatically adjust its size following the market’s demand for leverage. This is because in scenarios of negative funding, USDe redemptions are triggered, causing a contraction of short positions that pushes funding rates back up. This feedback loop minimizes prolonged negative funding periods and protects the protocol’s reserves.\n\n### **Solution**\n\nTo mitigate these risks, Chaos Labs and Llamarisk propose an improved pricing mechanism. The new mechanism would replace the USDe/USD secondary market price feed with a USDT/USD feed. By decoupling sUSDe pricing from USDe’s short-term market fluctuations, this proposal aims to reduce liquidation risks for all sUSDe-backed positions significantly.\n\nTo mitigate the risk associated with a USDe depeg event of unnecessary liquidations, we propose hardcoding USDe’s price to USDT. While utilizing a Proof of Reserve oracle would have been preferable to hardcoding, this solution still presents significant advantages without increasing the protocol’s risk.\n\nThanks to the presence of Ethena’s $60M insurance fund and the need for a prolonged negative funding event to affect USDe backing, Aave is presented with a significant time buffer to mitigate risk following a negative funding event properly.\n\nIn the case of persistent negative funding, Aave retains the option to adjust risk parameters, such as reducing LT. This proactive measure will force liquidations, which in turn will weaken the sUSDe peg, which is likely to cause redemptions. As previously explained, significant USDe redemptions increase funding rates and hence stabilize the USDe peg and demand without compromising the protocol’s safety.\n\nThe following chart demonstrates the correlation between the sUSDe in the unstaking queue and the sUSDe price deviation. The unstaking process length is 7 days, during which the asset does not earn any yield.\n\n## Specification\n\n**USDe**\n\nTo implement this change, the USDe pricing feed should be replaced with USDT’s price feed. The sUSDe oracle should similarly implement it in place of its BASE_TO_USD feed, ensuring consistent pricing across the protocol.\n\n**sUSDe**\n\nTo implement the proposed changes, it is required to modify the sUSDe oracle to incorporate the new pricing logic.\n\nThe sUSDe price will be determined using the following components:\n\n- **sUSDe/USDe exchange rate**, as currently and enhanced by the CAPO adapter.\n- **Chainlink’s USDT/USD price feed** to determine the final USD value of sUSDe.\n\n## References\n\n- Implementation: [AaveV3Ethereum](https://github.com/bgd-labs/aave-proposals-v3/blob/a718d64453d1fb68993d150761eab83c48860e02/src/20250213_Multi_SUSDeAndUSDePriceFeedUpdate/AaveV3Ethereum_SUSDeAndUSDePriceFeedUpdate_20250213.sol), [AaveV3EthereumLido](https://github.com/bgd-labs/aave-proposals-v3/blob/a718d64453d1fb68993d150761eab83c48860e02/src/20250213_Multi_SUSDeAndUSDePriceFeedUpdate/AaveV3EthereumLido_SUSDeAndUSDePriceFeedUpdate_20250213.sol), [AaveV3ZkSync](https://github.com/bgd-labs/aave-proposals-v3/blob/a718d64453d1fb68993d150761eab83c48860e02/zksync/src/20250213_Multi_SUSDeAndUSDePriceFeedUpdate/AaveV3ZkSync_SUSDeAndUSDePriceFeedUpdate_20250213.sol)\n- Tests: [AaveV3Ethereum](https://github.com/bgd-labs/aave-proposals-v3/blob/a718d64453d1fb68993d150761eab83c48860e02/src/20250213_Multi_SUSDeAndUSDePriceFeedUpdate/AaveV3Ethereum_SUSDeAndUSDePriceFeedUpdate_20250213.t.sol), [AaveV3EthereumLido](https://github.com/bgd-labs/aave-proposals-v3/blob/a718d64453d1fb68993d150761eab83c48860e02/src/20250213_Multi_SUSDeAndUSDePriceFeedUpdate/AaveV3EthereumLido_SUSDeAndUSDePriceFeedUpdate_20250213.t.sol), [AaveV3ZkSync](https://github.com/bgd-labs/aave-proposals-v3/blob/a718d64453d1fb68993d150761eab83c48860e02/zksync/src/20250213_Multi_SUSDeAndUSDePriceFeedUpdate/AaveV3ZkSync_SUSDeAndUSDePriceFeedUpdate_20250213.t.sol)\n- [Snapshot](https://snapshot.box/#/s:aave.eth/proposal/0xd09ac8571db4d8e70b57162d526e2e088295f6372d37eb0f2b68c5dfbf16d316)\n- [Discussion](https://governance.aave.com/t/arfc-susde-and-usde-price-feed-update/20495)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "title": "sUSDe and USDe Price Feed Update",
    "author": "Aave-chan Initiative",
    "discussions": "https://governance.aave.com/t/arfc-susde-and-usde-price-feed-update/20495",
    "snapshot": "https://snapshot.box/#/s:aave.eth/proposal/0xd09ac8571db4d8e70b57162d526e2e088295f6372d37eb0f2b68c5dfbf16d316",
    "originalIpfsHash": "0xd66c72d90cb2160fa50614ea18e83efe4e55f1e1ce481ac099d45c807906faa5"
  },
  "proposal": {
    "id": 262,
    "votingDuration": 259200,
    "creationTime": 1741008071,
    "accessLevel": 1,
    "state": 4,
    "queuingTime": 1741356011,
    "ipfsHash": "0xd66c72d90cb2160fa50614ea18e83efe4e55f1e1ce481ac099d45c807906faa5",
    "initialPayloads": [
      {
        "id": 254,
        "chainId": 1,
        "payloadsController": "0xdAbad81aF85554E9ae636395611C58F7eC1aAEc5"
      },
      {
        "id": 16,
        "chainId": 324,
        "payloadsController": "0x2E79349c3F5e4751E87b966812C9E65E805996F1"
      }
    ],
    "snapshotBlockHash": "0x3e5cd51cee93ebe3529200dcfabfa2993d8796ec7039c673406c1d40115d8261",
    "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
    "canceledAt": 0,
    "votingActivationTime": 1741094555,
    "votingChainId": 137,
    "votingMachineData": {
      "id": 262,
      "forVotes": "745255761602204350414803",
      "againstVotes": "39469842153260000000000",
      "startTime": 1741095648,
      "endTime": 1741354848,
      "votingClosedAndSentBlockNumber": 68758537,
      "votingClosedAndSentTimestamp": 1741354858,
      "l1BlockHash": "0x3e5cd51cee93ebe3529200dcfabfa2993d8796ec7039c673406c1d40115d8261",
      "strategy": "0x59e6CAD5d7E7b9A26a45a1d1E74C7aF008170042",
      "sentToGovernance": true,
      "createdBlock": 68638164,
      "votedInfo": {
        "support": false,
        "votingPower": "0"
      },
      "votingAssets": [
        "0x7Fc66500c84A76Ad7e9c93437bFc5Ac33E2DDaE9",
        "0x4da27a545c0c5B758a6BA100e3a049001de870f5",
        "0xA700b4eB416Be35b2911fd5Dee80678ff64fF6C9"
      ],
      "hasRequiredRoots": true
    },
    "isFinished": true,
    "lastUpdatedTimestamp": 1741825774,
    "cancellationFee": 50000000000000000
  }
}