{
  "payloads": [
    {
      "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
      "maximumAccessLevelRequired": 1,
      "state": 2,
      "createdAt": 1717251337,
      "queuedAt": 1717599663,
      "executedAt": 0,
      "cancelledAt": 0,
      "expirationTime": 1720275337,
      "delay": 86400,
      "gracePeriod": 604800,
      "actions": [
        {
          "target": "0x5594521a5132Faf674552cfc6387B75cF10F9924",
          "withDelegateCall": true,
          "accessLevel": 1,
          "value": "0",
          "signature": "execute()",
          "callData": "0x"
        }
      ],
      "id": 33,
      "chainId": 10,
      "payloadsController": "0x0E1a3Af1f9cC76A62eD31eDedca291E63632e7c4"
    }
  ],
  "ipfs": {
    "ipfsHash": "QmXVfdmpBjNQ9YxT1WGN35vN54a5NP3u5Gk1BHK7CuKVYW",
    "description": "\n## Simple Summary\n\nFollowing sUSD’s depeg, after which the market was frozen on V3 Optimism, we provide an update and recommend future actions.\n\n## Motivation\n\nsUSD depegged on May 16, 2024, with its price reaching a low of 0.915 relative to USDC. As it was depegging, we provided a full analysis of the cause and a recommendation to freeze its Optimism market; sUSD has since repegged.\n\nMarket Response to Freezing\n\nFollowing the market being frozen on May 16, we observed gradual withdrawals over the next four days, with about 1M sUSD withdrawn. However, starting May 20, withdrawals accelerated, and there are currently 5.16M sUSD deposited in the market.\n\nOn the other hand, the sUSD borrowed has been relatively stable, decreasing from 4.3M sUSD at the time of the freeze to 4.17M sUSD now. This is despite sUSD remaining depegged until May 21, incentivizing users who borrowed the asset to repay their debt.\n\nSynthetix has also announced its transition plan for V3, which details how it will scale sUSD. These updates include expanding the collateral assets for sUSD from SNX alone to SNX, ETH, USDC, and other yield-generating collateral and governance-approved tokens. Additionally, the protocol has incentivized sUSD liquidity providers on Velodrome (Optimism; 10,000 OP tokens per week in the sUSD/USDC pool) and Curve (Ethereum; 20,000 SNX tokens per week in the sUSD/USDC/DAI/USDT pool); liquidity has begun to improve as a result of these incentives.\n\nsUSD Exposure on Aave\n\nsUSD is listed on Aave V3 Optimism as a frozen collateral asset and Aave V2 Ethereum as a frozen, non-collateral asset. Since the freeze on Optimism, we have observed a sharp decrease in value borrowed against sUSD, as well as the amount borrowed against sUSD in E-Mode. The reduction in E-Mode borrowed against is especially important, given the high LT afforded in this market.\n\nRecommendations\n\nReduce Supply and Borrow Caps on Aave V3, Optimism: Given that the market’s size has decreased, as well as a decrease in on-chain supply — from 31M pre-freeze to 23.6M now — we recommend decreasing the supply and borrow caps ahead of unfreezing the asset. This will ensure that any future growth in the market is controlled and risk is minimized.\n\nWe recommend setting the caps according to our initial listing methodology, in which we determine the amount of an asset that can be liquidated with slippage lower than the LB, set at 1% in the stablecoin E-mode, and recommend the supply cap be double that amount. This leads us to a recommendation of a 7M sUSD supply cap and a borrow cap set at 80% of the supply cap at 5.6M sUSD.\nReduce Stablecoin E-Mode LT and LTV: We recommend reducing E-Mode LT and LTV for stablecoins in Optimism’s Stablecoin E-Mode. Reducing LTs will make the protocol more resilient to any potential depegs in the future, ensuring that there is larger buffer in the event a stablecoin’s price falls and liquidations occur. Additionally, lowering LTV will slightly reduce users’ stablecoin-stablecoin borrowing power, again reducing risk in these markets.\n\nA 2% LT reduction on the Optimism V3 stablecoin E-mode category will make 18 accounts eligible for liquidation, potentially inducing $25K in new liquidations.\nAdjust sUSD’s LTV and LT: Following the freeze of sUSD, its non-E-Mode LTV was dropped to 0%. Its current LT is 75%. Increasing the LTV will allow users to borrow non-stablecoin assets against their collateral, while adjusting the LT downwards will ensure the protocol has a larger buffer in the event of liquidations, whether from a depeg or from appreciation of borrowed assets.\n\nWe recommend increasing sUSD’s non-E-Mode LTV to 60% and reducing its non-E-Mode LT to 70%. At this time, this would lead to a negligible $8 in liquidation across 4 accounts.\nUnfreeze the sUSD market on Optimism: While sUSD has repegged, we note that the ongoing deprecation of synth assets may continue to cause peg volatility. The discount rate, which dictates the value synth asset holders can receive when they redeem, will continue to be lowered in an effort to deprecate these markets. Synth asset holders may request a redemption at parity, which, in the future, may carry some time-based conditions (i.e., sUSD is sent to the redeeming user over the course of weeks or months) to reduce the potential impact on sUSD’s peg. While the Synthetix Council has an incentive to ensure redemptions of synth assets with minimal price impacts, whether to the synth assets or sUSD, these time-based conditions are not codified.\n\nGiven this, as well as the reduced supply/borrow caps and E-Mode LT/LTV, we recommend unfreezing the market.\nWe would like to thank @kaleb and the Synthetix team for their collaboration, insights on the situation, and guidance on the protocol and governance mechanisms to stabilize the peg.\n\n## Specification\n\n| Asset | Parameter  | Current    | Rec       |\n| ----- | ---------- | ---------- | --------- |\n| sUSD  | Supply cap | 20,000,000 | 7,000,000 |\n| sUSD  | Borrow cap | 13,000,000 | 5,600,000 |\n| sUSD  | LT         | 75%        | 70%       |\n| sUSD  | LTV        | 0.0%       | 60%       |\n\nStablecoin E-Mode Specifications\n\n| Parameter | Current | Rec |\n| --------- | ------- | --- |\n| LT        | 95%     | 93% |\n| LTV       | 93%     | 90% |\n\n## References\n\n- Implementation: [AaveV3Optimism](https://github.com/bgd-labs/aave-proposals-v3/blob/ad5c895c51906be7b3ab7d2e61e6570644f3cbf5/src/20240528_AaveV3Optimism_ChaosLabsParameterRecommendationsSUSDOnV3Optimism/AaveV3Optimism_ChaosLabsParameterRecommendationsSUSDOnV3Optimism_20240528.sol)\n- Tests: [AaveV3Optimism](https://github.com/bgd-labs/aave-proposals-v3/blob/ad5c895c51906be7b3ab7d2e61e6570644f3cbf5/src/20240528_AaveV3Optimism_ChaosLabsParameterRecommendationsSUSDOnV3Optimism/AaveV3Optimism_ChaosLabsParameterRecommendationsSUSDOnV3Optimism_20240528.t.sol)\n- [Snapshot](https://snapshot.org/#/aave.eth/proposal/0xa66afef5e247d9369831e874a60d022ce6b12645b41d9a244077a3a279ef24f3)\n- [Discussion](https://governance.aave.com/t/arfc-chaos-labs-parameter-recommendations-susd-on-v3-optimism-05-232024/17779)\n\n## Copyright\n\nCopyright and related rights waived via [CC0](https://creativecommons.org/publicdomain/zero/1.0/).\n",
    "title": "Chaos Labs Parameter Recommendations sUSD on V3 Optimism",
    "author": "Chaos Labs",
    "discussions": "https://governance.aave.com/t/arfc-chaos-labs-parameter-recommendations-susd-on-v3-optimism-05-232024/17779",
    "originalIpfsHash": "0x880874b26e761785fe82e63387b1c4eeb48375ed71d3333f245076b7fc636183"
  },
  "proposal": {
    "id": 114,
    "votingDuration": 259200,
    "creationTime": 1717251407,
    "accessLevel": 1,
    "state": 4,
    "queuingTime": 1717599515,
    "ipfsHash": "0x880874b26e761785fe82e63387b1c4eeb48375ed71d3333f245076b7fc636183",
    "initialPayloads": [
      {
        "id": 33,
        "chainId": 10,
        "payloadsController": "0x0E1a3Af1f9cC76A62eD31eDedca291E63632e7c4"
      }
    ],
    "snapshotBlockHash": "0xcbf1a7379338ed5a9449b6e51b0add2fce10f07cd16899d132425aae84a9025a",
    "creator": "0x57ab7ee15cE5ECacB1aB84EE42D5A9d0d8112922",
    "canceledAt": 0,
    "votingActivationTime": 1717337831,
    "votingChainId": 137,
    "votingMachineData": {
      "id": 114,
      "forVotes": "669731823693492319010004",
      "againstVotes": "0",
      "startTime": 1717338940,
      "endTime": 1717598140,
      "votingClosedAndSentBlockNumber": 57799604,
      "votingClosedAndSentTimestamp": 1717598152,
      "l1BlockHash": "0xcbf1a7379338ed5a9449b6e51b0add2fce10f07cd16899d132425aae84a9025a",
      "strategy": "0x59e6CAD5d7E7b9A26a45a1d1E74C7aF008170042",
      "sentToGovernance": true,
      "createdBlock": 57684699,
      "votedInfo": {
        "support": false,
        "votingPower": "0"
      },
      "votingAssets": [
        "0x7Fc66500c84A76Ad7e9c93437bFc5Ac33E2DDaE9",
        "0x4da27a545c0c5B758a6BA100e3a049001de870f5",
        "0xA700b4eB416Be35b2911fd5Dee80678ff64fF6C9"
      ],
      "hasRequiredRoots": true
    },
    "isFinished": false,
    "lastUpdatedTimestamp": 1717621598,
    "cancellationFee": 50000000000000000
  }
}